In [1]:
import pandas as pd

In [5]:
# url = 'https://tinyurl.com/titanic-csv'
url = 'train.csv'

In [7]:
dataframe = pd.read_csv(url)

In [8]:
dataframe.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
670,671,1,2,"Brown, Mrs. Thomas William Solomon (Elizabeth ...",female,40.0,1,1,29750,39.00,NaN,S
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.90,C65,C
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,A4. 54510,8.05,NaN,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.00,B51 B53 B55,S
406,407,0,3,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.75,NaN,S

In [9]:
dataframe = dataframe.set_index(dataframe['Name'])

In [10]:
dataframe.loc['Moore, Mr. Leonard Charles']

PassengerId                           122
Survived                                0
Pclass                                  3
Name           Moore, Mr. Leonard Charles
Sex                                  male
Age                                   NaN
SibSp                                   0
Parch                                   0
Ticket                          A4. 54510
Fare                                 8.05
Cabin                                 NaN
Embarked                                S
Name: Moore, Mr. Leonard Charles, dtype: object

In [11]:
dataframe[dataframe['Sex'] == 'female'].sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Meek, Mrs. Thomas (Annie Louise Rowley)",416,0,3,"Meek, Mrs. Thomas (Annie Louise Rowley)",female,NaN,0,0,343095,8.05,NaN,S
"Phillips, Miss. Kate Florence (""Mrs Kate Louise Phillips Marshall"")",428,1,2,"Phillips, Miss. Kate Florence (""Mrs Kate Louis...",female,19.0,0,0,250655,26.00,NaN,S
"Kelly, Miss. Mary",574,1,3,"Kelly, Miss. Mary",female,NaN,0,0,14312,7.75,NaN,Q
"Keane, Miss. Nora A",304,1,2,"Keane, Miss. Nora A",female,NaN,0,0,226593,12.35,E101,Q
"Landergren, Miss. Aurora Adelia",377,1,3,"Landergren, Miss. Aurora Adelia",female,22.0,0,0,C 7077,7.25,NaN,S

In [13]:
dataframe.rename(columns={'Pclass':'Passenger Class'}).sample(2)

,PassengerId,Survived,Passenger Class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
"Ohman, Miss. Velin",555,1,3,"Ohman, Miss. Velin",female,22.0,0,0,347085,7.7750,NaN,S
"Baclini, Mrs. Solomon (Latifa Qurban)",859,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",female,24.0,0,3,2666,19.2583,NaN,C

In [15]:
dataframe['Sex'].unique()

array(['male', 'female'], dtype=object)

In [18]:
dataframe['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [21]:
dataframe.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [22]:
for name in dataframe['Name'][0:2]:
    print(name)

Braund, Mr. Owen Harris
Cumings, Mrs. John Bradley (Florence Briggs Thayer)

In [23]:
dataframe['Name'].head(2)

Name
Braund, Mr. Owen Harris                                                          Braund, Mr. Owen Harris
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    Cumings, Mrs. John Bradley (Florence Briggs Th...
Name: Name, dtype: object

In [24]:
[name.upper() for name in dataframe['Name'][0:2]]

['BRAUND, MR. OWEN HARRIS',
 'CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)']

In [26]:
def capital(str):
    return str.upper()

In [27]:
capital('abc')

'ABC'

In [29]:
dataframe['Name'].apply(capital)[0:2]

Name
Braund, Mr. Owen Harris                                                          BRAUND, MR. OWEN HARRIS
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

In [31]:
dataframe['Name'].apply(lambda x: x.upper())[0:2]

Name
Braund, Mr. Owen Harris                                                          BRAUND, MR. OWEN HARRIS
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

In [33]:
dataframe.groupby('Sex').apply(lambda x: x.count())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,,
female,314,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,577,453,577,577,577,577,107,577